Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LE_DFP/1.2.273/include/pic32cm1216le00032.h
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct _DeviceVectors
{
  /* Stack pointer */
  void* pvStack;
  /* CORTEX-M23 handlers */
  void* pfnReset_Handler;                        /* -15 Reset Vector, invoked on Power up and warm reset */
  void* pfnNonMaskableInt_Handler;               /* -14 Non maskable Interrupt, cannot be stopped or preempted */
  void* pfnHardFault_Handler;                    /* -13 Hard Fault, all classes of Fault */
  void* pvReservedC12;
  void* pvReservedC11;
  void* pvReservedC10;
  void* pvReservedC9;
  void* pvReservedC8;
  void* pvReservedC7;
  void* pvReservedC6;
  void* pfnSVCall_Handler;                       /*  -5 System Service Call via SVC instruction */
  void* pvReservedC4;
  void* pvReservedC3;
  void* pfnPendSV_Handler;                       /*  -2 Pendable request for system service */
  void* pfnSysTick_Handler;                      /*  -1 System Tick Timer */

  /* Peripheral handlers */
  void* pfnSYSTEM_Handler;                       /*   0 System peripherals shared interrupt (MCLK OSCCTRL OSC32KCTRL PM SUPC) */
  void* pfnWDT_Handler;                          /*   1 Watchdog Timer (WDT) */
  void* pfnRTC_Handler;                          /*   2 Real-Time Counter (RTC) */
  void* pfnEIC_EXTINT_0_Handler;                 /*   3 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_1_Handler;                 /*   4 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_2_Handler;                 /*   5 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_3_Handler;                 /*   6 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_4_Handler;                 /*   7 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_5_Handler;                 /*   8 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_6_Handler;                 /*   9 External Interrupt Controller (EIC) */
  void* pfnEIC_EXTINT_7_Handler;                 /*  10 External Interrupt Controller (EIC) */
  void* pfnEIC_OTHER_Handler;                    /*  11 External Interrupt Controller (EIC) */
  void* pfnFREQM_Handler;                        /*  12 Frequency Meter (FREQM) */
  void* pfnNVMCTRL_Handler;                      /*  13 Non-Volatile Memory Controller (NVMCTRL) */
  void* pvReserved14;
  void* pfnDMAC_0_Handler;                       /*  15 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_1_Handler;                       /*  16 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_2_Handler;                       /*  17 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_3_Handler;                       /*  18 Direct Memory Access Controller (DMAC) */
  void* pfnDMAC_OTHER_Handler;                   /*  19 Direct Memory Access Controller (DMAC) */
  void* pfnUSB_Handler;                          /*  20 Universal Serial Bus (USB) */
  void* pfnEVSYS_0_Handler;                      /*  21 Event System Interface (EVSYS) */
  void* pfnEVSYS_1_Handler;                      /*  22 Event System Interface (EVSYS) */
  void* pfnEVSYS_2_Handler;                      /*  23 Event System Interface (EVSYS) */
  void* pfnEVSYS_3_Handler;                      /*  24 Event System Interface (EVSYS) */
  void* pfnEVSYS_4_Handler;                      /*  25 Event System Interface (EVSYS) */
  void* pfnEVSYS_5_Handler;                      /*  26 Event System Interface (EVSYS) */
  void* pfnEVSYS_6_Handler;                      /*  27 Event System Interface (EVSYS) */
  void* pfnEVSYS_7_Handler;                      /*  28 Event System Interface (EVSYS) */
  void* pvReserved29;
  void* pfnPAC_Handler;                          /*  30 Peripheral Access Controller (PAC) */
  void* pfnSERCOM0_0_Handler;                    /*  31 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_1_Handler;                    /*  32 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_2_Handler;                    /*  33 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM0_OTHER_Handler;                /*  34 Serial Communication Interface (SERCOM0) */
  void* pfnSERCOM1_0_Handler;                    /*  35 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_1_Handler;                    /*  36 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_2_Handler;                    /*  37 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM1_OTHER_Handler;                /*  38 Serial Communication Interface (SERCOM1) */
  void* pfnSERCOM2_0_Handler;                    /*  39 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_1_Handler;                    /*  40 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_2_Handler;                    /*  41 Serial Communication Interface (SERCOM2) */
  void* pfnSERCOM2_OTHER_Handler;                /*  42 Serial Communication Interface (SERCOM2) */
  void* pvReserved43;
  void* pvReserved44;
  void* pvReserved45;
  void* pvReserved46;
  void* pvReserved47;
  void* pvReserved48;
  void* pvReserved49;
  void* pvReserved50;
  void* pvReserved51;
  void* pvReserved52;
  void* pvReserved53;
  void* pvReserved54;
  void* pfnTC0_Handler;                          /*  55 Basic Timer Counter (TC0) */
  void* pfnTC1_Handler;                          /*  56 Basic Timer Counter (TC1) */
  void* pfnTC2_Handler;                          /*  57 Basic Timer Counter (TC2) */
  void* pvReserved58;
  void* pvReserved59;
  void* pvReserved60;
  void* pvReserved61;
  void* pfnADC_OTHER_Handler;                    /*  62 Analog Digital Converter (ADC) */
  void* pfnADC_RESRDY_Handler;                   /*  63 Analog Digital Converter (ADC) */
  void* pfnAC_Handler;                           /*  64 Analog Comparators (AC) */
  void* pfnDAC_UNDERRUN_Handler;                 /*  65 Digital-to-Analog Converter (DAC) */
  void* pfnDAC_EMPTY_Handler;                    /*  66 Digital-to-Analog Converter (DAC) */
  void* pfnPTC_Handler;                          /*  67 Peripheral Touch Controller (PTC) */
  void* pfnTRNG_Handler;                         /*  68 True Random Generator (TRNG) */
  void* pvReserved69;
  void* pfnTRAM_Handler;                         /*  70 TrustRAM (TRAM) */
} DeviceVectors;

